tot0rokr/MeshSerial-of-nRF5-SDK-for-Mesh/nrf5_SDK_for_Mesh_v5.0.0_src/mesh/serial/src/serial_handler_mesh.c
static void handle_cmd_appkey_add(const serial_packet_t * p_cmd)
{
    serial_evt_cmd_rsp_data_appkey_t rsp;
    dsm_handle_t appkey_handle;
    uint32_t status = dsm_appkey_add(p_cmd->payload.cmd.mesh.appkey_add.app_key_index,
            p_cmd->payload.cmd.mesh.appkey_add.subnet_handle,
            p_cmd->payload.cmd.mesh.appkey_add.key,
            &appkey_handle);
    rsp.appkey_handle = appkey_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_appkey_update(const serial_packet_t * p_cmd)
{
    uint32_t status = dsm_appkey_update(p_cmd->payload.cmd.mesh.appkey_update.appkey_handle,
            p_cmd->payload.cmd.mesh.appkey_update.key);
    serial_evt_cmd_rsp_data_appkey_t rsp;
    rsp.appkey_handle = p_cmd->payload.cmd.mesh.appkey_update.appkey_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_appkey_delete(const serial_packet_t * p_cmd)
{
    uint32_t status = dsm_appkey_delete(p_cmd->payload.cmd.mesh.appkey_delete.appkey_handle);
    serial_evt_cmd_rsp_data_appkey_t rsp;
    rsp.appkey_handle = p_cmd->payload.cmd.mesh.appkey_delete.appkey_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_appkey_get_all(const serial_packet_t * p_cmd)
{
    serial_evt_cmd_rsp_data_appkey_list_t rsp;
    uint16_t appkey_key_index[sizeof(rsp.appkey_key_index)];
    uint32_t count = ARRAY_SIZE(rsp.appkey_key_index);
    /* Can not use response directly because taking address of packed member of 'struct <anonymous>'
       may result in an unaligned pointer value. Compiler warning with GNU Tools ARM Embedded
       9-2019-q4-major. */
    uint32_t status = dsm_appkey_get_all(p_cmd->payload.cmd.mesh.appkey_get_all.subnet_handle, appkey_key_index, &count);
    if (count == 0)
    {
        serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, NULL, 0);
    }
    else
    {
        rsp.subnet_handle = p_cmd->payload.cmd.mesh.appkey_get_all.subnet_handle;
        memcpy((uint16_t *) rsp.appkey_key_index, (uint16_t *) appkey_key_index, sizeof(uint16_t) * count);
        serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode,
                status,
                (uint8_t *) &rsp,
                offsetof(serial_evt_cmd_rsp_data_appkey_list_t, appkey_key_index) + sizeof(uint16_t) * count);
    }
}

static void handle_cmd_appkey_count_max_get(const serial_packet_t * p_cmd)
{
    serial_evt_cmd_rsp_data_list_size_t rsp;
    rsp.list_size = DSM_APP_MAX;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, NRF_SUCCESS, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_devkey_add(const serial_packet_t * p_cmd)
{
    serial_evt_cmd_rsp_data_devkey_t rsp;
    uint16_t devkey_handle;
    /* Can not use response directly because taking address of packed member of 'struct <anonymous>'
       may result in an unaligned pointer value. Compiler warning with GNU Tools ARM Embedded
       9-2019-q4-major. */
    uint32_t status = dsm_devkey_add(p_cmd->payload.cmd.mesh.devkey_add.owner_addr,
            p_cmd->payload.cmd.mesh.devkey_add.subnet_handle,
            p_cmd->payload.cmd.mesh.devkey_add.key,
            &devkey_handle);
    rsp.devkey_handle = devkey_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_devkey_delete(const serial_packet_t * p_cmd)
{
    uint32_t status = dsm_devkey_delete(p_cmd->payload.cmd.mesh.devkey_delete.devkey_handle);
    serial_evt_cmd_rsp_data_devkey_t rsp;
    rsp.devkey_handle = p_cmd->payload.cmd.mesh.devkey_delete.devkey_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_devkey_count_max_get(const serial_packet_t * p_cmd)
{
    serial_evt_cmd_rsp_data_list_size_t rsp;
    rsp.list_size = DSM_DEVICE_MAX;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, NRF_SUCCESS, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_addr_local_unicast_set(const serial_packet_t * p_cmd)
{
    dsm_local_unicast_address_t local = {
        .address_start = p_cmd->payload.cmd.mesh.local_unicast_addr_set.start_address,
        .count         = p_cmd->payload.cmd.mesh.local_unicast_addr_set.count
    };
    uint32_t status = dsm_local_unicast_addresses_set(&local);
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, NULL, 0);
}

static void handle_cmd_addr_local_unicast_get(const serial_packet_t * p_cmd)
{
    dsm_local_unicast_address_t local;
    dsm_local_unicast_addresses_get(&local);
    serial_evt_cmd_rsp_data_addr_local_unicast_t rsp;
    rsp.address_start = local.address_start;
    rsp.count         = local.count;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, NRF_SUCCESS, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_addr_get(const serial_packet_t * p_cmd)
{
    nrf_mesh_address_t addr;
    uint32_t status = dsm_address_get(p_cmd->payload.cmd.mesh.addr_get.address_handle, &addr);
    serial_evt_cmd_rsp_data_raw_addr_t rsp = {0};
    uint32_t rsp_size = 0;

    if (status == NRF_SUCCESS)
    {
        rsp.address_handle = p_cmd->payload.cmd.mesh.addr_get.address_handle;
        rsp.addr_type = addr.type;
        rsp.subscribed = nrf_mesh_is_address_rx(&addr);
        rsp.raw_short_addr = addr.value;

        if (addr.p_virtual_uuid)
        {
            memcpy(rsp.virtual_uuid, addr.p_virtual_uuid, NRF_MESH_UUID_SIZE);
            rsp_size = sizeof(rsp);
        }
        else
        {
            rsp_size = sizeof(rsp) - NRF_MESH_UUID_SIZE;
        }
    }
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode,
            status,
            (uint8_t *) &rsp,
            rsp_size);
}

static void handle_cmd_addr_get_all(const serial_packet_t * p_cmd)
{
    serial_evt_cmd_rsp_data_addr_list_t rsp;
    uint16_t address_handles[sizeof(rsp.address_handles)];
    uint32_t count = ARRAY_SIZE(rsp.address_handles);
    /* Can not use response directly because taking address of packed member of 'struct <anonymous>'
       may result in an unaligned pointer value. Compiler warning with GNU Tools ARM Embedded
       9-2019-q4-major. */
    uint32_t status = dsm_address_get_all(address_handles, &count);
    if (count > 0)
    {
        memcpy((uint16_t *) rsp.address_handles, (uint16_t *) address_handles, sizeof(uint16_t) * count);
        serial_handler_common_cmd_rsp_nodata_on_error(
            p_cmd->opcode, status, (uint8_t *) rsp.address_handles, sizeof(uint16_t) * count);
    }
    else
    {
        serial_handler_common_cmd_rsp_nodata_on_error(
            p_cmd->opcode, status, NULL, 0);
    }
}

static void handle_cmd_addr_nonvirtual_count_max_get(const serial_packet_t * p_cmd)
{
    serial_evt_cmd_rsp_data_list_size_t rsp;
    rsp.list_size = DSM_NONVIRTUAL_ADDR_MAX;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, NRF_SUCCESS, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_addr_virtual_count_max_get(const serial_packet_t * p_cmd)
{
    serial_evt_cmd_rsp_data_list_size_t rsp;
    rsp.list_size = DSM_VIRTUAL_ADDR_MAX;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, NRF_SUCCESS, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_addr_subscription_add(const serial_packet_t * p_cmd)
{
    dsm_handle_t address_handle;
    uint32_t status = dsm_address_subscription_add(p_cmd->payload.cmd.mesh.addr_subscription_add.address, &address_handle);
    serial_evt_cmd_rsp_data_addr_t rsp;
    rsp.address_handle = address_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

