tot0rokr/MeshSerial-of-nRF5-SDK-for-Mesh/nrf5_SDK_for_Mesh_v5.0.0_src/mesh/serial/src/serial_handler_mesh.c
static void handle_cmd_addr_subscription_add_virtual(const serial_packet_t * p_cmd)
{
    dsm_handle_t address_handle;
    uint32_t status = dsm_address_subscription_virtual_add(p_cmd->payload.cmd.mesh.addr_subscription_add_virtual.uuid, &address_handle);
    serial_evt_cmd_rsp_data_addr_t rsp;
    rsp.address_handle = address_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_addr_subscription_remove(const serial_packet_t * p_cmd)
{
    uint32_t status = dsm_address_subscription_remove(p_cmd->payload.cmd.mesh.addr_subscription_remove.address_handle);
    serial_evt_cmd_rsp_data_addr_t rsp;
    rsp.address_handle = p_cmd->payload.cmd.mesh.addr_subscription_remove.address_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_addr_publication_add(const serial_packet_t * p_cmd)
{
    dsm_handle_t address_handle;
    uint32_t status = dsm_address_publish_add(p_cmd->payload.cmd.mesh.addr_publication_add.address, &address_handle);
    serial_evt_cmd_rsp_data_addr_t rsp;
    rsp.address_handle = address_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_addr_publication_add_virtual(const serial_packet_t * p_cmd)
{
    dsm_handle_t address_handle;
    uint32_t status = dsm_address_publish_virtual_add(p_cmd->payload.cmd.mesh.addr_publication_add_virtual.uuid, &address_handle);
    serial_evt_cmd_rsp_data_addr_t rsp;
    rsp.address_handle = address_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_addr_publication_remove(const serial_packet_t * p_cmd)
{
    uint32_t status = dsm_address_publish_remove(p_cmd->payload.cmd.mesh.addr_publication_remove.address_handle);
    serial_evt_cmd_rsp_data_addr_t rsp;
    rsp.address_handle = p_cmd->payload.cmd.mesh.addr_publication_remove.address_handle;
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_packet_send(const serial_packet_t * p_cmd)
{
    nrf_mesh_tx_params_t tx_params;
    memset(&tx_params, 0, sizeof(tx_params));

    serial_evt_cmd_rsp_data_packet_send_t rsp;
    rsp.token = nrf_mesh_unique_token_get();

    uint32_t status = dsm_address_get(p_cmd->payload.cmd.mesh.packet_send.dst_addr_handle, &tx_params.dst);
    if (status == NRF_SUCCESS)
    {
        dsm_local_unicast_address_t valid_src_addrs;
        dsm_local_unicast_addresses_get(&valid_src_addrs);

        if (p_cmd->payload.cmd.mesh.packet_send.src_addr <  valid_src_addrs.address_start ||
            p_cmd->payload.cmd.mesh.packet_send.src_addr >= valid_src_addrs.address_start + valid_src_addrs.count)
        {
            status = NRF_ERROR_INVALID_ADDR;
        }
        else
        {
#if MESH_FEATURE_LPN_ENABLED
            status = NRF_ERROR_NOT_FOUND;
            if (p_cmd->payload.cmd.mesh.packet_send.friendship_credential_flag)
            {
                status = dsm_tx_friendship_secmat_get(DSM_HANDLE_INVALID, p_cmd->payload.cmd.mesh.packet_send.appkey_handle,
                                                      &tx_params.security_material);
            }

            /* @tagMeshSp section 4.2.2.4:
             *
             * When Publish Friendship Credential Flag is set to 1 and the friendship security material is
             * not available, the master security material shall be used. */
            if (NRF_ERROR_NOT_FOUND == status)
#endif
            {
                status = dsm_tx_secmat_get(DSM_HANDLE_INVALID,
                                           p_cmd->payload.cmd.mesh.packet_send.appkey_handle,
                                           &tx_params.security_material);
            }
            if (status == NRF_SUCCESS)
            {
                tx_params.src       = p_cmd->payload.cmd.mesh.packet_send.src_addr;
                tx_params.ttl       = p_cmd->payload.cmd.mesh.packet_send.ttl;
                tx_params.force_segmented  = p_cmd->payload.cmd.mesh.packet_send.force_segmented;
                tx_params.transmic_size = (nrf_mesh_transmic_size_t) p_cmd->payload.cmd.mesh.packet_send.transmic_size;
                if (p_cmd->length > NRF_MESH_SERIAL_PACKET_OVERHEAD + SERIAL_CMD_MESH_PACKET_SEND_OVERHEAD)
                {
                    tx_params.p_data    = p_cmd->payload.cmd.mesh.packet_send.data;
                    tx_params.data_len  = p_cmd->length - SERIAL_CMD_MESH_PACKET_SEND_OVERHEAD - NRF_MESH_SERIAL_PACKET_OVERHEAD;
                }
                else
                {
                    tx_params.p_data = NULL;
                    tx_params.data_len = 0;
                }
                tx_params.tx_token = rsp.token;

                status = nrf_mesh_packet_send(&tx_params, NULL);
            }
        }
    }
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *) &rsp, sizeof(rsp));
}

static void handle_cmd_clear(const serial_packet_t * p_cmd)
{
    mesh_stack_config_clear();
    serial_cmd_rsp_send(p_cmd->opcode, SERIAL_STATUS_SUCCESS, NULL, 0);
}

static void handle_config_devkey_bind(const serial_packet_t * p_cmd)
{
    uint32_t status = config_server_bind(p_cmd->payload.cmd.mesh.config_server_devkey_bind.address_handle);
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, NULL, 0);
}

static void handle_net_state_set(const serial_packet_t * p_cmd)
{
#if PERSISTENT_STORAGE
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, NRF_ERROR_INVALID_STATE, NULL, 0);
#else
    uint32_t status = net_state_iv_index_and_seqnum_block_set(
                            p_cmd->payload.cmd.mesh.net_state_set.iv_index,
                            p_cmd->payload.cmd.mesh.net_state_set.iv_update_in_progress,
                            p_cmd->payload.cmd.mesh.net_state_set.next_seqnum_block);
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, NULL, 0);
#endif
}

static void handle_net_state_get(const serial_packet_t * p_cmd)
{
    mesh_opt_iv_index_persist_data_t iv_index_data;
    mesh_opt_seqnum_persist_data_t   seqnum_data;

    uint32_t status = mesh_config_entry_get(MESH_OPT_NET_STATE_IV_INDEX_EID, (void *)&iv_index_data);
    if (status != NRF_SUCCESS)
    {
        serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, NULL, 0);
        return;
    }

    status = mesh_config_entry_get(MESH_OPT_NET_STATE_SEQ_NUM_BLOCK_EID, (void *)&seqnum_data);

    serial_evt_cmd_rsp_data_net_state_get_t rsp = {
        .iv_index = iv_index_data.iv_index,
        .iv_update_in_progress = (uint8_t) iv_index_data.iv_update_in_progress,
        .iv_update_timeout_counter = iv_index_data.iv_update_timeout_counter,
        .next_seqnum_block = seqnum_data.next_block
    };
    serial_handler_common_cmd_rsp_nodata_on_error(p_cmd->opcode, status, (uint8_t *)&rsp, sizeof(rsp));
}

static inline uint32_t heartbeat_publication_count_decode(uint8_t count_log)
{
    if (count_log == 0x00)
    {
        return 0x00;
    }
    else if (count_log <= HEARTBEAT_MAX_COUNT_LOG)
    {
        return (1 << (count_log - 1));
    }
    else if (count_log == HEARTBEAT_INF_COUNT_LOG)
    {
        return HEARTBEAT_INF_COUNT;
    }
    else
    {
        return HEARTBEAT_INVALID_COUNT;
    }
}

