tot0rokr/MeshSerial-of-nRF5-SDK-for-Mesh/nrf5_SDK_for_Mesh_v5.0.0_src/mesh/serial/src/serial_handler_mesh.c
static inline uint32_t heartbeat_pubsub_period_decode(uint8_t period_log)
{
    if (period_log == 0x00)
    {
        return 0x00;
    }
    else if (period_log <= HEARTBEAT_MAX_PERIOD_LOG)
    {
        return (1 << (period_log - 1));
    }
    else
    {
        return HEARTBEAT_INVALID_PERIOD;
    }
}

static inline uint8_t heartbeat_pubsub_period_encode(uint32_t period)
{
    if (period == 0)
    {
        return 0x00;
    }
    else if (period <= HEARTBEAT_MAX_PERIOD)
    {
        return (log2_get(period) + 1);
    }
    else
    {
        NRF_MESH_ASSERT(false);
        return HEARTBEAT_MAX_PERIOD_LOG;
    }
}

static inline uint8_t heartbeat_publication_count_encode(uint32_t count)
{
    if (count <= 1)
    {
        return count;
    }
    else if (count <= HEARTBEAT_MAX_COUNT)
    {
        /* Finding smallest n where 2^(n-1) is greater than or equal to the count value */
        return (log2_get(count - 1) + 1 + 1);
    }
    else if (count == HEARTBEAT_INF_COUNT)
    {
        return HEARTBEAT_INF_COUNT_LOG;
    }
    else
    {
        NRF_MESH_ASSERT(false);
        return HEARTBEAT_MAX_COUNT_LOG;
    }
}

static inline uint8_t heartbeat_subscription_count_encode(uint32_t count)
{
    if (count == 0)
    {
        return 0x00;
    }
    else if (count <= HEARTBEAT_MAX_COUNT)
    {
        /* Finding largest n where 2^(n-1) is less than or equal to the count value */
        return (log2_get(count) + 1);
    }
    else if (count == HEARTBEAT_INF_COUNT)
    {
        return HEARTBEAT_INF_COUNT_LOG;
    }
    else
    {
        NRF_MESH_ASSERT(false);
        return HEARTBEAT_MAX_COUNT_LOG;
    }
}

static void handle_heartbeat_publication_get(const serial_packet_t * p_cmd)
{
    const heartbeat_publication_state_t * p_hb_pub = heartbeat_publication_get();
    serial_evt_cmd_rsp_data_hb_publication_get_t rsp = {
        .dst = p_hb_pub->dst,
        .count_log = heartbeat_publication_count_encode(p_hb_pub->count),
        .period_log = heartbeat_pubsub_period_encode(p_hb_pub->period),
        .ttl = p_hb_pub->ttl,
        .features = p_hb_pub->features,
        .netkey_index = p_hb_pub->netkey_index
    };
    serial_cmd_rsp_send(p_cmd->opcode, SERIAL_STATUS_SUCCESS, (uint8_t *)&rsp, sizeof(rsp));
}

/*****************************************************************************
* Static functions
*****************************************************************************/
/**
 * Opcode-handler and -length lookup table.
 */
static const mesh_serial_cmd_handler_t m_handlers[] =
{
    {SERIAL_OPCODE_CMD_MESH_ENABLE,                         0,                                                       0,  handle_cmd_enable},
    {SERIAL_OPCODE_CMD_MESH_DISABLE,                        0,                                                       0,  handle_cmd_disable},
    {SERIAL_OPCODE_CMD_MESH_SUBNET_ADD,                     sizeof(serial_cmd_mesh_subnet_add_t),                    0,  handle_cmd_subnet_add},
    {SERIAL_OPCODE_CMD_MESH_SUBNET_UPDATE,                  sizeof(serial_cmd_mesh_subnet_update_t),                 0,  handle_cmd_subnet_update},
    {SERIAL_OPCODE_CMD_MESH_SUBNET_DELETE,                  sizeof(serial_cmd_mesh_subnet_delete_t),                 0,  handle_cmd_subnet_delete},
    {SERIAL_OPCODE_CMD_MESH_SUBNET_GET_ALL,                 0,                                                       0,  handle_cmd_subnet_get_all},
    {SERIAL_OPCODE_CMD_MESH_SUBNET_COUNT_MAX_GET,           0,                                                       0,  handle_cmd_subnet_count_max_get},
    {SERIAL_OPCODE_CMD_MESH_APPKEY_ADD,                     sizeof(serial_cmd_mesh_appkey_add_t),                    0,  handle_cmd_appkey_add},
    {SERIAL_OPCODE_CMD_MESH_APPKEY_UPDATE,                  sizeof(serial_cmd_mesh_appkey_update_t),                 0,  handle_cmd_appkey_update},
    {SERIAL_OPCODE_CMD_MESH_APPKEY_DELETE,                  sizeof(serial_cmd_mesh_appkey_delete_t),                 0,  handle_cmd_appkey_delete},
    {SERIAL_OPCODE_CMD_MESH_APPKEY_GET_ALL,                 sizeof(serial_cmd_mesh_appkey_get_all_t),                0,  handle_cmd_appkey_get_all},
    {SERIAL_OPCODE_CMD_MESH_APPKEY_COUNT_MAX_GET,           0,                                                       0,  handle_cmd_appkey_count_max_get},
    {SERIAL_OPCODE_CMD_MESH_DEVKEY_ADD,                     sizeof(serial_cmd_mesh_devkey_add_t),                    0,  handle_cmd_devkey_add},
    {SERIAL_OPCODE_CMD_MESH_DEVKEY_DELETE,                  sizeof(serial_cmd_mesh_devkey_delete_t),                 0,  handle_cmd_devkey_delete},
    {SERIAL_OPCODE_CMD_MESH_DEVKEY_COUNT_MAX_GET,           0,                                                       0,  handle_cmd_devkey_count_max_get},
    {SERIAL_OPCODE_CMD_MESH_ADDR_LOCAL_UNICAST_SET,         sizeof(serial_cmd_mesh_addr_local_unicast_set_t),        0,  handle_cmd_addr_local_unicast_set},
    {SERIAL_OPCODE_CMD_MESH_ADDR_LOCAL_UNICAST_GET,         0,                                                       0,  handle_cmd_addr_local_unicast_get},
    {SERIAL_OPCODE_CMD_MESH_ADDR_SUBSCRIPTION_ADD,          sizeof(serial_cmd_mesh_addr_subscription_add_t),         0,  handle_cmd_addr_subscription_add},
    {SERIAL_OPCODE_CMD_MESH_ADDR_SUBSCRIPTION_ADD_VIRTUAL,  sizeof(serial_cmd_mesh_addr_subscription_add_virtual_t), 0,  handle_cmd_addr_subscription_add_virtual},
    {SERIAL_OPCODE_CMD_MESH_ADDR_SUBSCRIPTION_REMOVE,       sizeof(serial_cmd_mesh_addr_subscription_remove_t),      0,  handle_cmd_addr_subscription_remove},
    {SERIAL_OPCODE_CMD_MESH_ADDR_PUBLICATION_ADD,           sizeof(serial_cmd_mesh_addr_publication_add_t),          0,  handle_cmd_addr_publication_add},
    {SERIAL_OPCODE_CMD_MESH_ADDR_PUBLICATION_ADD_VIRTUAL,   sizeof(serial_cmd_mesh_addr_publication_add_virtual_t),  0,  handle_cmd_addr_publication_add_virtual},
    {SERIAL_OPCODE_CMD_MESH_ADDR_PUBLICATION_REMOVE,        sizeof(serial_cmd_mesh_addr_publication_remove_t),       0,  handle_cmd_addr_publication_remove},
    {SERIAL_OPCODE_CMD_MESH_ADDR_GET,                       sizeof(serial_cmd_mesh_addr_get_t),                      0,  handle_cmd_addr_get},
    {SERIAL_OPCODE_CMD_MESH_ADDR_GET_ALL,                   0,                                                       0,  handle_cmd_addr_get_all},
    {SERIAL_OPCODE_CMD_MESH_ADDR_NONVIRTUAL_COUNT_MAX_GET,  0,                                                       0,  handle_cmd_addr_nonvirtual_count_max_get},
    {SERIAL_OPCODE_CMD_MESH_ADDR_VIRTUAL_COUNT_MAX_GET,     0,                                                       0,  handle_cmd_addr_virtual_count_max_get},
    {SERIAL_OPCODE_CMD_MESH_PACKET_SEND, SERIAL_CMD_MESH_PACKET_SEND_OVERHEAD, sizeof(serial_cmd_mesh_packet_send_t) - SERIAL_CMD_MESH_PACKET_SEND_OVERHEAD,  handle_cmd_packet_send},
    {SERIAL_OPCODE_CMD_MESH_STATE_CLEAR,                    0,                                                       0,  handle_cmd_clear},
    {SERIAL_OPCODE_CMD_MESH_CONFIG_SERVER_BIND,             sizeof(serial_cmd_mesh_config_server_devkey_bind_t),     0,  handle_config_devkey_bind},
    {SERIAL_OPCODE_CMD_MESH_NET_STATE_SET,                  sizeof(serial_cmd_mesh_net_state_set_t),                 0,  handle_net_state_set},
    {SERIAL_OPCODE_CMD_MESH_NET_STATE_GET,                  0,                                                       0,  handle_net_state_get},
    {SERIAL_OPCODE_CMD_MESH_HB_PUBLICATION_GET,             0,                                                       0,  handle_heartbeat_publication_get}
    /*
     * {SERIAL_OPCODE_CMD_MESH_HB_PUBLICATION_SET,             sizeof(serial_cmd_mesh_hb_publication_set_t),            0,  handle_heartbeat_publication_set},
     * {SERIAL_OPCODE_CMD_MESH_HB_SUBSCRIPTION_GET,            sizeof(serial_cmd_mesh_hb_subscription_get_t),           0,  handle_heartbeat_subscription_get},
     * {SERIAL_OPCODE_CMD_MESH_HB_SUBSCRIPTION_SET,            sizeof(serial_cmd_mesh_hb_subscription_set_t),           0,  handle_heartbeat_subscription_set}
     */
};

