tot0rokr/MeshSerial-of-nRF5-SDK-for-Mesh/nrf5_SDK_for_Mesh_v5.0.0_src/mesh/serial/src/serial_handler_mesh.c
static void mesh_config_listener_cb(mesh_config_change_reason_t reason, mesh_config_entry_id_t id, const void * p_entry)
{
    if (reason == MESH_CONFIG_CHANGE_REASON_SET && id.file == MESH_OPT_NET_STATE_FILE_ID)
    {
        static serial_packet_t * p_serial_evt;

        switch (id.record)
        {
            case MESH_OPT_NET_STATE_SEQ_NUM_BLOCK_RECORD:
            {
                uint32_t status = serial_packet_buffer_get(sizeof(serial_evt_mesh_seqnum_entry_set_notification_t) + 1, &p_serial_evt);
                if (status != NRF_SUCCESS)
                {
                    break;
                }
                mesh_opt_seqnum_persist_data_t * p_seqnum_data = (mesh_opt_seqnum_persist_data_t *)p_entry;
                p_serial_evt->opcode = SERIAL_OPCODE_EVT_MESH_SEQNUM_ENTRY_SET_NOTIFICATION;
                p_serial_evt->payload.evt.mesh.seqnum_entry_set.next_block = p_seqnum_data->next_block;
                serial_tx(p_serial_evt);
                break;
            }
            case MESH_OPT_NET_STATE_IV_INDEX_RECORD:
            {
                uint32_t status = serial_packet_buffer_get(sizeof(serial_evt_mesh_iv_entry_set_notification_t) + 1, &p_serial_evt);
                if (status != NRF_SUCCESS)
                {
                    break;
                }
                mesh_opt_iv_index_persist_data_t * p_iv_index_data = (mesh_opt_iv_index_persist_data_t *)p_entry;
                p_serial_evt->opcode = SERIAL_OPCODE_EVT_MESH_IV_ENTRY_SET_NOTIFICATION;
                p_serial_evt->payload.evt.mesh.iv_entry_set.iv_index = p_iv_index_data->iv_index;
                p_serial_evt->payload.evt.mesh.iv_entry_set.iv_update_in_progress = p_iv_index_data->iv_update_in_progress;
                p_serial_evt->payload.evt.mesh.iv_entry_set.iv_update_timout_counter = p_iv_index_data->iv_update_timeout_counter;
                serial_tx(p_serial_evt);
                break;
            }
            default:
                break;
        }
    }
}

MESH_CONFIG_LISTENER(m_seqnum_listener, MESH_OPT_NET_STATE_SEQ_NUM_BLOCK_EID, mesh_config_listener_cb);
MESH_CONFIG_LISTENER(m_iv_index_listener, MESH_OPT_NET_STATE_IV_INDEX_EID, mesh_config_listener_cb);

static void serial_handler_mesh_evt_handle(const nrf_mesh_evt_t* p_evt)
{
    static serial_packet_t * p_serial_evt;
    uint32_t status;
    switch (p_evt->type)
    {
        case NRF_MESH_EVT_MESSAGE_RECEIVED:
        {
            uint32_t data_length = p_evt->params.message.length;

            if (data_length > SERIAL_EVT_MESH_MESSAGE_RECEIVED_DATA_MAXLEN)
            {
                data_length = SERIAL_EVT_MESH_MESSAGE_RECEIVED_DATA_MAXLEN;
            }
            status = serial_packet_buffer_get(data_length + SERIAL_EVT_MESH_MESSAGE_RECEIVED_LEN_OVERHEAD, &p_serial_evt);
            if (status != NRF_SUCCESS)
            {
                break;
            }

            serial_evt_mesh_message_received_t * p_msg_rcvd = &p_serial_evt->payload.evt.mesh.message_received;
            p_msg_rcvd->actual_length = p_evt->params.message.length;
            if (p_evt->params.message.dst.type == NRF_MESH_ADDRESS_TYPE_UNICAST)
            {
                p_serial_evt->opcode = SERIAL_OPCODE_EVT_MESH_MESSAGE_RECEIVED_UNICAST;
                p_msg_rcvd->dst = p_evt->params.message.dst.value;
            }
            else
            {
                p_serial_evt->opcode = SERIAL_OPCODE_EVT_MESH_MESSAGE_RECEIVED_SUBSCRIPTION;
                dsm_handle_t dst;
                /* Can not use response directly because taking address of packed member of 'struct <anonymous>'
                   may result in an unaligned pointer value. Compiler warning with GNU Tools ARM Embedded
                   9-2019-q4-major. */
                NRF_MESH_ASSERT(NRF_SUCCESS == dsm_address_handle_get(&p_evt->params.message.dst, &dst));
                p_msg_rcvd->dst = (uint16_t) dst;
            }
            p_msg_rcvd->src = p_evt->params.message.src.value;
            p_msg_rcvd->appkey_handle = dsm_appkey_handle_get(p_evt->params.message.secmat.p_app);
            p_msg_rcvd->subnet_handle = dsm_subnet_handle_get(p_evt->params.message.secmat.p_net);
            p_msg_rcvd->ttl = p_evt->params.message.ttl;
            p_msg_rcvd->adv_addr_type = p_evt->params.message.p_metadata->params.scanner.adv_addr.addr_type;
            memcpy(p_msg_rcvd->adv_addr, p_evt->params.message.p_metadata->params.scanner.adv_addr.addr, BLE_GAP_ADDR_LEN);
            p_msg_rcvd->rssi = p_evt->params.message.p_metadata->params.scanner.rssi;

            if (data_length > 0)
            {
                memcpy(p_msg_rcvd->data,
                        p_evt->params.message.p_buffer,
                        data_length);
            }
            serial_tx(p_serial_evt);
            break;
        }
        case NRF_MESH_EVT_IV_UPDATE_NOTIFICATION:
            status = serial_packet_buffer_get(SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_evt_mesh_iv_update_t), &p_serial_evt);
            if (status == NRF_SUCCESS)
            {
                p_serial_evt->opcode = SERIAL_OPCODE_EVT_MESH_IV_UPDATE_NOTIFICATION;
                p_serial_evt->payload.evt.mesh.iv_update.iv_index = p_evt->params.iv_update.iv_index;
                serial_tx(p_serial_evt);
            }
            break;

        case NRF_MESH_EVT_KEY_REFRESH_NOTIFICATION:
            status = serial_packet_buffer_get(SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_evt_mesh_key_refresh_t), &p_serial_evt);
            if (status == NRF_SUCCESS)
            {
                p_serial_evt->opcode = SERIAL_OPCODE_EVT_MESH_KEY_REFRESH_NOTIFICATION;
                p_serial_evt->payload.evt.mesh.key_refresh.netkey_index = p_evt->params.key_refresh.subnet_index;
                p_serial_evt->payload.evt.mesh.key_refresh.phase = p_evt->params.key_refresh.phase;
                serial_tx(p_serial_evt);
            }
            break;
        case NRF_MESH_EVT_HB_MESSAGE_RECEIVED:
            status = serial_packet_buffer_get(SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_evt_mesh_hb_message_t), &p_serial_evt);
            if (status == NRF_SUCCESS)
            {
                p_serial_evt->opcode = SERIAL_OPCODE_EVT_MESH_HEARTBEAT_RECEIVED;
                p_serial_evt->payload.evt.mesh.heartbeat.init_ttl = p_evt->params.hb_message.init_ttl;
                p_serial_evt->payload.evt.mesh.heartbeat.hops = p_evt->params.hb_message.hops;
                p_serial_evt->payload.evt.mesh.heartbeat.features = p_evt->params.hb_message.features;
                p_serial_evt->payload.evt.mesh.heartbeat.src = p_evt->params.hb_message.src;
                serial_tx(p_serial_evt);
            }
            break;
        case NRF_MESH_EVT_TX_COMPLETE:
            status = serial_packet_buffer_get(SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_evt_mesh_tx_complete_t), &p_serial_evt);
            if (status == NRF_SUCCESS)
            {
                p_serial_evt->opcode = SERIAL_OPCODE_EVT_MESH_TX_COMPLETE;
                p_serial_evt->payload.evt.mesh.tx_complete.token = p_evt->params.tx_complete.token;
                serial_tx(p_serial_evt);
            }
            break;

        default:
            break;
    }
}

/*****************************************************************************
* Interface functions
*****************************************************************************/
void serial_handler_mesh_init(void)
{
    m_evt_handler.evt_cb = serial_handler_mesh_evt_handle;
    nrf_mesh_evt_handler_add(&m_evt_handler);
}

void serial_handler_mesh_rx(const serial_packet_t* p_cmd)
{
    NRF_MESH_ASSERT(p_cmd->opcode >= SERIAL_OPCODE_CMD_RANGE_MESH_START &&
                    p_cmd->opcode <= SERIAL_OPCODE_CMD_RANGE_MESH_END);
    if (p_cmd->opcode >= SERIAL_OPCODE_CMD_RANGE_MESH_START + (sizeof(m_handlers) / sizeof(mesh_serial_cmd_handler_t)))
    {
        serial_cmd_rsp_send(p_cmd->opcode, SERIAL_STATUS_ERROR_CMD_UNKNOWN, NULL, 0);
    }
    else
    {
        const mesh_serial_cmd_handler_t * p_handler = &m_handlers[p_cmd->opcode - SERIAL_OPCODE_CMD_RANGE_MESH_START];

        /* Make sure our handler array is up to date. */
        NRF_MESH_ASSERT(p_cmd->opcode == p_handler->opcode);

        if (p_cmd->length < SERIAL_PACKET_LENGTH_OVERHEAD + p_handler->min_param_length ||
            p_cmd->length > SERIAL_PACKET_LENGTH_OVERHEAD + p_handler->min_param_length + p_handler->optional_extra_bytes)
        {
            serial_cmd_rsp_send(p_cmd->opcode, SERIAL_STATUS_ERROR_INVALID_LENGTH, NULL, 0);
        }
        else
        {
            p_handler->handler_cb(p_cmd);
        }
    }
}
